app/controllers/api/v1/user_destinations_controller.rb

    def index
        @userDestinations = UserDestination.all
---
SELECT "user_destinations".* FROM "user_destinations"